app/controllers/user/papers_controller.rb

INSERT INTO "papers" ("paper_file_file_name", "paper_file_content_type", "paper_file_file_size", "paper_file_updated_at", "name", "user_id", "path", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "papers" SET "user_id" = $1, "path" = $2, "updated_at" = $3 WHERE "papers"."id" = $4  [["user_id", 4], ["path", "public/papers/images.jpeg"], ["updated_at", "2015-11-09 21:08:55.422332"], ["id", 19]]
---
  def create
    @paper = Paper.create(paper_params)
    @paper.user_id = params[:user_id]
    if @paper.valid?
      @paper.save